eisup_2019_docmng_integration/src/Documents/абс_РасчетСтрокАБФ/абс_РасчетСтрокАБФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РасчетСтрокАБФ</name>
  <registerRecords>AccumulationRegister.абс_ЗначенияПоказателейСтрокАБФ</registerRecords>
  <attributes>
    <name>ПериодНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>CatalogRef.абс_ФормыАБФ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиАБФ</name>
    <attributes>
      <name>СтрокаФормы</name>
      <type>
        <types>CatalogRef.абс_СтрокиАБФРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>Форма</name>
      <type>
        <types>CatalogRef.абс_ФормыАБФ</types>
      </type>
    </attributes>
    <attributes>
      <name>Бюджет</name>
      <type>
        <types>CatalogRef.абс_БюджетыРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательБюджета</name>
      <type>
        <types>CatalogRef.абс_ПоказателиБюджетаРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификаторЕБК</name>
      <type>
        <types>CatalogRef.абс_ЕБК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементКлассификатораЕБК</name>
      <type>
        <types>CatalogRef.абс_ЗначенияКлассификатораЕБК</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКлассификатораЕБК</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетПроизведен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификаторЕБК2</name>
      <type>
        <types>CatalogRef.абс_ЕБК</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементКлассификатораЕБК2</name>
      <type>
        <types>CatalogRef.абс_ЗначенияКлассификатораЕБК</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКлассификатораЕБК2</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакПлюс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстаткиНаНачалоПериода</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеПроводокПоказателямБюджетаРЖД/абс_СоответствиеПроводокПоказателямБюджетаРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеПроводокПоказателямБюджетаРЖД</name>
  <resources>
    <name>Минус</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстаткиНаНачалоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СчетДт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бюджет</name>
    <type>
      <types>CatalogRef.абс_БюджетыРЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказательБюджета</name>
    <type>
      <types>CatalogRef.абс_ПоказателиБюджетаРЖД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеАналитикЕБК/абс_СоответствиеАналитикЕБК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеАналитикЕБК</name>
  <dimensions>
    <name>ВидАналитики</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлассификаторЕБК</name>
    <type>
      <types>CatalogRef.абс_ЕБК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеКлассификатораЕБК</name>
    <type>
      <types>CatalogRef.абс_ЗначенияКлассификатораЕБК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ЗначенияПоказателейСтрокАБФ/абс_ЗначенияПоказателейСтрокАБФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ЗначенияПоказателейСтрокАБФ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтрокаФормы</name>
    <type>
      <types>CatalogRef.абс_СтрокиАБФРЖД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Catalogs/абс_СтрокиАБФРЖД/абс_СтрокиАБФРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_СтрокиАБФРЖД</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.абс_ФормыАБФ</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бюджет</name>
    <type>
      <types>CatalogRef.абс_БюджетыРЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательБюджета</name>
    <type>
      <types>CatalogRef.абс_ПоказателиБюджетаРЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторЕБК</name>
    <type>
      <types>CatalogRef.абс_ЕБК</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЭлементаКлассификатораЕБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементКлассификатораЕБК</name>
    <type>
      <types>CatalogRef.абс_ЗначенияКлассификатораЕБК</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхнийУровень</name>
    <type>
      <types>CatalogRef.абс_СтрокиАБФРЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗнакПлюс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторЕБК2</name>
    <type>
      <types>CatalogRef.абс_ЕБК</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЭлементаКлассификатораЕБК2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементКлассификатораЕБК2</name>
    <type>
      <types>CatalogRef.абс_ЗначенияКлассификатораЕБК</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/абс_РасчетСтрокАБФ/ObjectModule.bsl
Процедура ЗаполнитьСтрокиАБФ() Экспорт
	
	Запрос = Новый запрос(
	"ВЫБРАТЬ
	|	абс_СтрокиАБФРЖД.Ссылка КАК СтрокаФормы,
	|	абс_СтрокиАБФРЖД.Владелец КАК Форма,
	|	абс_СтрокиАБФРЖД.Бюджет,
	|	абс_СтрокиАБФРЖД.ПоказательБюджета,
	|	абс_СтрокиАБФРЖД.КлассификаторЕБК,
	|	абс_СтрокиАБФРЖД.ЭлементКлассификатораЕБК,
	|	абс_СтрокиАБФРЖД.КлассификаторЕБК.ТипКлассификатора КАК ТипКлассификатораЕБК,
	|	абс_СоответствиеПроводокПоказателямБюджетаРЖД.СчетДт,
	|	абс_СоответствиеПроводокПоказателямБюджетаРЖД.СчетКт
	|ИЗ
	|	Справочник.абс_СтрокиАБФРЖД КАК абс_СтрокиАБФРЖД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеПроводокПоказателямБюджетаРЖД КАК абс_СоответствиеПроводокПоказателямБюджетаРЖД
	|		ПО абс_СтрокиАБФРЖД.Бюджет = абс_СоответствиеПроводокПоказателямБюджетаРЖД.Бюджет
	|			И абс_СтрокиАБФРЖД.ПоказательБюджета = абс_СоответствиеПроводокПоказателямБюджетаРЖД.ПоказательБюджета
	|ГДЕ
	|	абс_СтрокиАБФРЖД.Владелец = &Форма
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_СтрокиАБФРЖД.Порядок");
	
	Запрос.УстановитьПараметр("Форма", Форма);
	
	СтрокиАБФ.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

Процедура РасчетСтрокАБФ() Экспорт
	
	Для Каждого СтрокаАБФ Из СтрокиАБФ Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаАБФ.ПоказательБюджета) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаАБФ.Сумма = ПолучитьЗначениеСтрокиАБФ(СтрокаАБФ);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначениеСтрокиАБФ(СтруктураСтроки) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Субконто1) = &ТипАналитики
	|			ТОГДА ХозрасчетныйОбороты.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Субконто2) = &ТипАналитики
	|			ТОГДА ХозрасчетныйОбороты.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Субконто3) = &ТипАналитики
	|			ТОГДА ХозрасчетныйОбороты.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаДт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.КорСубконто1) = &ТипАналитики
	|			ТОГДА ХозрасчетныйОбороты.КорСубконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.КорСубконто2) = &ТипАналитики
	|			ТОГДА ХозрасчетныйОбороты.КорСубконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.КорСубконто3) = &ТипАналитики
	|			ТОГДА ХозрасчетныйОбороты.КорСубконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаКт,
	|	ХозрасчетныйОбороты.СуммаОборот,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ПОМЕСТИТЬ ВТ_ОборотыДтКтАналитика
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&ПериодНач,
	|			&ПериодКон,
	|			,
	|			ВЫБОР
	|				КОГДА (НЕ &Счет = &ПустойСчет)
	|					ТОГДА &Счет = &СчетДт
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ,
	|			,
	|			,
	|			ВЫБОР
	|				КОГДА (НЕ &СчетКт = &ПустойСчет)
	|					ТОГДА КорСчет = &СчетКт
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ,
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыДтКтАналитика.АналитикаДт,
	|	ВТ_ОборотыДтКтАналитика.АналитикаКт,
	|	ВТ_ОборотыДтКтАналитика.СуммаОборот,
	|	ВТ_ОборотыДтКтАналитика.СуммаОборотДт,
	|	ВТ_ОборотыДтКтАналитика.СуммаОборотКт,
	|	МаппингДт.ЗначениеКлассификатораЕБК КАК ЗначениеКлассификатораЕБКДт,
	|	МаппингКт.ЗначениеКлассификатораЕБК КАК ЗначениеКлассификатораЕБККт,
	|	ВЫБОР
	|		КОГДА (НЕ ВТ_ОборотыДтКтАналитика.СуммаОборотДт = &ПустойСчет)
	|				И (НЕ ВТ_ОборотыДтКтАналитика.СуммаОборотКт = &ПустойСчет)
	|			ТОГДА ВТ_ОборотыДтКтАналитика.СуммаОборотДт
	|		КОГДА (НЕ ВТ_ОборотыДтКтАналитика.СуммаОборотДт = &ПустойСчет)
	|				И ВТ_ОборотыДтКтАналитика.СуммаОборотКт = &ПустойСчет
	|			ТОГДА ВТ_ОборотыДтКтАналитика.СуммаОборотДт
	|		КОГДА ВТ_ОборотыДтКтАналитика.СуммаОборотДт = &ПустойСчет
	|				И (НЕ ВТ_ОборотыДтКтАналитика.СуммаОборотКт = &ПустойСчет)
	|			ТОГДА ВТ_ОборотыДтКтАналитика.СуммаОборотКт
	|	КОНЕЦ КАК Поле1
	|ИЗ
	|	ВТ_ОборотыДтКтАналитика КАК ВТ_ОборотыДтКтАналитика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеАналитикЕБК КАК МаппингДт
	|		ПО ВТ_ОборотыДтКтАналитика.АналитикаДт = МаппингДт.ЗначениеАналитики
	|			И (МаппингДт.КлассификаторЕБК = &КлассификаторЕБК)
	|			И (МаппингДт.ЗначениеКлассификатораЕБК = &ЗначениеКлассификатораЕБК)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеАналитикЕБК КАК МаппингКт
	|		ПО ВТ_ОборотыДтКтАналитика.АналитикаКт = МаппингКт.ЗначениеАналитики
	|			И (МаппингКт.КлассификаторЕБК = &КлассификаторЕБК)
	|			И (МаппингКт.ЗначениеКлассификатораЕБК = &ЗначениеКлассификатораЕБК)");
	
	
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.абс_ЗначенияПоказателейСтрокАБФ.Записывать = Истина;
	Движения.абс_ЗначенияПоказателейСтрокАБФ.Очистить();
	
	ТаблицаДвижений = СтрокиАБФ.Выгрузить(Новый Структура("РасчетПроизведен", Истина));
	ТаблицаДвижений.Свернуть("СтрокаФормы", "Сумма");
	
	Для Каждого СтрокаДвижений Из ТаблицаДвижений Цикл
		Движение = Движения.абс_ЗначенияПоказателейСтрокАБФ.Добавить();
		Движение.Период = ПериодНач;
		ЗаполнитьЗначенияСвойств(Движение, СтрокаДвижений);
	КонецЦикла;
	
КонецПроцедуры
